# ExternallyTaggedBRep Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternallyTaggedBRep Methods
ExternallyTaggedBRep Class See Also
---
The ExternallyTaggedBRep type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from ExternallyTaggedGeometryObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetTaggedGeometry | Returns the externally tagged geometry object. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ExternallyTaggedBRep Class
Autodesk.Revit.DB Namespace